Tekla.Structures.AnalysisInternal.DotAnalysisEngine
DO NOT USE! For internal usage only!

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.operation
The operation.

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.analysisEngineName
The name of the analysis engine.

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.type
The type of the analysis engine.

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.parameters
The parameters in one string with | separator.

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.ToStruct(Tekla.Structures.AnalysisInternal.AnalysisEngine,Tekla.Structures.AnalysisInternal.DotAnalysisEngine.OperationEnum)
Set DotAnalysisEngine struct
analysisEngine: The analysis engine.
operation: The operation.

Tekla.Structures.AnalysisInternal.DotAnalysisEngine.FromStruct(Tekla.Structures.AnalysisInternal.AnalysisEngine)
Get DotAnalysisEngine struct
analysisEngine: The analysis engine.